# Tutorial: Inserting Records and DataFrames Into a SQL Database

[Dataquest - EXCELENTE] (https://www.dataquest.io/blog/sql-insert-tutorial/)

# Do You Need a SQL Certification to Get a Data Job in 2021?

[Dataquest] (https://www.dataquest.io/blog/sql-certification/)

# SQL Fundamentals

[Dataquest] (https://www.dataquest.io/path/sql-skills/)

# What is the to_sql() function pandas Python?

[Educative] (https://www.educative.io/edpresso/what-is-the-tosql-function-pandas-python)

In [1]:
import pandas as pd
import pymysql

## Inserindo dados usando pymysql

In [2]:
df = pd .read_csv('sales$$ Data Sample.csv')
df.head(3)

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium

In [3]:
arquivo = 'sales_data_sample'
normaliza_nome_tabela = arquivo.lower().replace(" ","_").replace("?","") \
                    .replace("-","_").replace(r"/","_").replace("\\","_").replace(r"%","") \
                    .replace(")","").replace(r"(","").replace("?","").replace("$","")
normaliza_nome_tabela

'sales_data_sample'

In [4]:
df.columns

Index(['ORDERNUMBER', 'QUANTITYORDERED', 'PRICEEACH', 'ORDERLINENUMBER',
       'SALES', 'ORDERDATE', 'STATUS', 'QTR_ID', 'MONTH_ID', 'YEAR_ID',
       'PRODUCTLINE', 'MSRP', 'PRODUCTCODE', 'CUSTOMERNAME', 'PHONE',
       'ADDRESSLINE1', 'ADDRESSLINE2', 'CITY', 'STATE', 'POSTALCODE',
       'COUNTRY', 'TERRITORY', 'CONTACTLASTNAME', 'CONTACTFIRSTNAME',
       'DEALSIZE'],
      dtype='object')

In [5]:
# Para isso usaremos list comphreension
df.columns = [x.lower().replace(" ","_").replace("?","") \
                    .replace("-","_").replace(r"/","_").replace("\\","_").replace(r"%","") \
                    .replace(")","").replace(r"(","").replace("?","").replace("$","") for x in df.columns]

df.columns

Index(['ordernumber', 'quantityordered', 'priceeach', 'orderlinenumber',
       'sales', 'orderdate', 'status', 'qtr_id', 'month_id', 'year_id',
       'productline', 'msrp', 'productcode', 'customername', 'phone',
       'addressline1', 'addressline2', 'city', 'state', 'postalcode',
       'country', 'territory', 'contactlastname', 'contactfirstname',
       'dealsize'],
      dtype='object')

In [6]:
df.head(2)

,ordernumber,quantityordered,priceeach,orderlinenumber,sales,orderdate,status,qtr_id,month_id,year_id,...,addressline1,addressline2,city,state,postalcode,country,territory,contactlastname,contactfirstname,dealsize
0,10107,30,95.70,2,2871.0,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.9,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small

create table sales_data_sample
(
    ordernumber           int
    quantityordered       int
    priceeach           float
    orderlinenumber       int
    sales               float
    orderdate            varchar
    status               varchar
    qtr_id                int
    month_id              int
    year_id               int
    productline          varchar
    msrp                  int
    productcode          varchar
    customername         varchar
    phone                varchar
    addressline1         varchar
    addressline2         varchar
    city                 varchar
    state                varchar
    postalcode           varchar
    country              varchar
    territory            varchar
    contactlastname      varchar
    contactfirstname     varchar
    dealsize             varchar
);

In [7]:
df.dtypes

ordernumber           int64
quantityordered       int64
priceeach           float64
orderlinenumber       int64
sales               float64
orderdate            object
status               object
qtr_id                int64
month_id              int64
year_id               int64
productline          object
msrp                  int64
productcode          object
customername         object
phone                object
addressline1         object
addressline2         object
city                 object
state                object
postalcode           object
country              object
territory            object
contactlastname      object
contactfirstname     object
dealsize             object
dtype: object

In [8]:
substituicoes = {
    'object': 'varchar',
    'float64': 'float',
    'int64': 'int',
    'datetime64': 'timestamp',
    'timedelta64[ns]': 'varchar'    
}

substituicoes

{'object': 'varchar',
 'float64': 'float',
 'int64': 'int',
 'datetime64': 'timestamp',
 'timedelta64[ns]': 'varchar'}

In [9]:
col_string = ", ".join("{} {}".format(n, d) for (n, d) in zip(df.columns, df.dtypes.replace(substituicoes)))
col_string

'ordernumber int, quantityordered int, priceeach float, orderlinenumber int, sales float, orderdate varchar, status varchar, qtr_id int, month_id int, year_id int, productline varchar, msrp int, productcode varchar, customername varchar, phone varchar, addressline1 varchar, addressline2 varchar, city varchar, state varchar, postalcode varchar, country varchar, territory varchar, contactlastname varchar, contactfirstname varchar, dealsize varchar'

In [10]:
# fazer conexÃ£o com o banco de dados mysql -- ,db='sales'

conn=pymysql.connect(host='127.0.0.1',port=int(3306),user='conectado',passwd='Wikazako!-1975')

cursor = conn.cursor()
print("ConexÃ£o ao banco de dados estabelecida com sucesso, novamente!!!")

ConexÃ£o ao banco de dados estabelecida com sucesso, novamente!!!

In [11]:
cursor.execute("SHOW DATABASES;")
resultado = cursor.fetchall()
for i in resultado:
    print(i)

('classicmodels',)
('employees',)
('estudantes',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('world',)

In [12]:
cursor.execute("DROP DATABASE IF EXISTS sales;")
print("Banco de dados excluido com exito...")

Banco de dados excluido com exito...

In [13]:
cursor.execute("CREATE DATABASE IF NOT EXISTS sales;")
print("Banco de dados criado com exito...")

Banco de dados criado com exito...

In [14]:
cursor.execute("USE sales;")
print("Banco acessado com exito...")

Banco acessado com exito...

In [15]:
# excluir tabela customer_contracts se jÃ¡ existir
cursor.execute("drop table if exists sales_data;")
print("Tabela excluida com exito")

Tabela excluida com exito

'ordernumber int, quantityordered int, priceeach float, orderlinenumber int, sales float, orderdate varchar(20), status varchar(20), qtr_id int, month_id int, year_id int, productline varchar(20), msrp int, productcode varchar(20), customername varchar(50), phone varchar(20), addressline1 varchar(50), addressline2 varchar(20), city varchar(20), state varchar(20), postalcode varchar(20), country varchar(20), territory varchar(20), contactlastname varchar(20), contactfirstname varchar(20), dealsize varchar(20)

In [16]:
#criar a tabela sales_data
cursor.execute("CREATE TABLE sales_data(ordernumber int, \
                                        quantityordered int, \
                                        priceeach float, \
                                        orderlinenumber int, \
                                        sales float, \
                                        orderdate varchar(20), \
                                        status varchar(20), \
                                        qtr_id int, \
                                        month_id int, \
                                        year_id int, \
                                        productline varchar(20), \
                                        msrp int, \
                                        productcode varchar(20), \
                                        customername varchar(50), \
                                        phone varchar(20), \
                                        addressline1 varchar(50), \
                                        addressline2 varchar(20), \
                                        city varchar(20), \
                                        state varchar(20), \
                                        postalcode varchar(20), \
                                        country varchar(20), \
                                        territory varchar(20), \
                                        contactlastname varchar(20), \
                                        contactfirstname varchar(20), \
                                        dealsize varchar(20));")
print("Estrutura da tabela 'SALES_DATA' criada com exito")

Estrutura da tabela 'SALES_DATA' criada com exito

In [17]:
# Dump do dataframe para csv

# salvando o df para csv
df.to_csv('sales_data.csv', header=df.columns, index=False, encoding='utf8')

# abrir o arquivo .csv, salva-lo como tipo object, e fazer upload para o db
#meu_arquivo = open('sales_data.csv')
print('Dump do dataframe para csv realizado com sucesso!')

Dump do dataframe para csv realizado com sucesso!

In [18]:
df2 = pd.read_csv('sales_data.csv')

In [19]:
df2 = df2.where(pd.notnull(df2), None)

In [20]:
# creating column list for insertion
cols = "`,`".join([str(i) for i in df2.columns.tolist()])

# Insert DataFrame records one by one.
for i,row in df2.iterrows():
    sql = "INSERT INTO `sales_data` (`" +cols + "`) VALUES (" + "%s,"*(len(row)-1) + "%s)"
    cursor.execute(sql, tuple(row))

    # the connection is not autocommitted by default, so we must commit to save our changes
    conn.commit()
    if i > 2800:
        print(f"Registro {i+1} inserido com exito no BD sales..")

Registro 2802 inserido com exito no BD sales..
Registro 2803 inserido com exito no BD sales..
Registro 2804 inserido com exito no BD sales..
Registro 2805 inserido com exito no BD sales..
Registro 2806 inserido com exito no BD sales..
Registro 2807 inserido com exito no BD sales..
Registro 2808 inserido com exito no BD sales..
Registro 2809 inserido com exito no BD sales..
Registro 2810 inserido com exito no BD sales..
Registro 2811 inserido com exito no BD sales..
Registro 2812 inserido com exito no BD sales..
Registro 2813 inserido com exito no BD sales..
Registro 2814 inserido com exito no BD sales..
Registro 2815 inserido com exito no BD sales..
Registro 2816 inserido com exito no BD sales..
Registro 2817 inserido com exito no BD sales..
Registro 2818 inserido com exito no BD sales..
Registro 2819 inserido com exito no BD sales..
Registro 2820 inserido com exito no BD sales..
Registro 2821 inserido com exito no BD sales..
Registro 2822 inserido com exito no BD sales..
Registro 2823 inserido com exito no BD sales..

In [21]:
cursor.execute("select customername,productline from sales_data where status='Shipped' limit 20;")
result = cursor.fetchall()
for i in result:
    print(i)

('Land of Toys Inc.', 'Motorcycles')
('Reims Collectables', 'Motorcycles')
('Lyon Souveniers', 'Motorcycles')
('Toys4GrownUps.com', 'Motorcycles')
('Corporate Gift Ideas Co.', 'Motorcycles')
('Technics Stores Inc.', 'Motorcycles')
('Daedalus Designs Imports', 'Motorcycles')
('Herkku Gifts', 'Motorcycles')
('Mini Wheels Co.', 'Motorcycles')
('Auto Canal Petit', 'Motorcycles')
('Australian Collectors, Co.', 'Motorcycles')
('Vitachrome Inc.', 'Motorcycles')
('Tekni Collectables Inc.', 'Motorcycles')
('Gift Depot Inc.', 'Motorcycles')
('La Rochelle Gifts', 'Motorcycles')
("Marta's Replicas Co.", 'Motorcycles')
('Toys of Finland, Co.', 'Motorcycles')
('Baane Mini Imports', 'Motorcycles')
('Diecast Classics Inc.', 'Motorcycles')
('Land of Toys Inc.', 'Motorcycles')

In [22]:
df3 = pd.read_sql_query("select * from sales_data",conn)
df3.head()

,ordernumber,quantityordered,priceeach,orderlinenumber,sales,orderdate,status,qtr_id,month_id,year_id,...,addressline1,addressline2,city,state,postalcode,country,territory,contactlastname,contactfirstname,dealsize
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,None,NYC,NY,10022,USA,None,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,None,Reims,None,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,None,Paris,None,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,None,Pasadena,CA,90003,USA,None,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,None,San Francisco,CA,None,USA,None,Brown,Julie,Medium

In [23]:
conn.close()

## Mesmo processo usando sqlalchemy e a funÃ§Ã£o to_sql()

In [24]:
# import the module db="employee" /{db}
from sqlalchemy import create_engine

# create sqlalchemy engine
engine = create_engine("mysql+pymysql://{user}:{pw}@127.0.0.1/{db}"
                       .format(user="conectado",
                               pw="Wikazako!-1975",
                               db="sales"
                               ))
print("ConexÃ£o ao banco de dados estabelecida com sucesso, novamente!!!")

ConexÃ£o ao banco de dados estabelecida com sucesso, novamente!!!

In [25]:
# Insert whole DataFrame into MySQL
df2.to_sql('sales_data', con = engine, if_exists = 'append', chunksize = 1000, index=False)

In [26]:
engine.execute("SELECT * FROM sales_data where ordernumber='10107'").fetchall()

[(10107, 30, 95.7, 2, 2871.0, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 95, 'S10_1678', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Small'),
 (10107, 39, 99.91, 5, 3896.49, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 118, 'S10_2016', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Medium'),
 (10107, 27, 100.0, 4, 6065.55, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 193, 'S10_4698', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Medium'),
 (10107, 21, 100.0, 1, 3036.6, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 150, 'S12_2823', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Medium'),
 (10107, 29, 70.87, 6, 2055.23, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 60, 'S18_2625', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Small'),
 (10107, 25, 100.0, 3, 2845.75, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 112, 'S24_1578', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Small'),
 (10107, 38, 83.03, 7, 3155.14, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 76, 'S24_2000', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Medium'),
 (10107, 20, 92.9, 8, 1858.0, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 99, 'S32_1374', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Small'),
 (10107, 30, 95.7, 2, 2871.0, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 95, 'S10_1678', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Small'),
 (10107, 39, 99.91, 5, 3896.49, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 118, 'S10_2016', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Medium'),
 (10107, 27, 100.0, 4, 6065.55, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 193, 'S10_4698', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Medium'),
 (10107, 21, 100.0, 1, 3036.6, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 150, 'S12_2823', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Medium'),
 (10107, 29, 70.87, 6, 2055.23, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 60, 'S18_2625', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Small'),
 (10107, 25, 100.0, 3, 2845.75, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 112, 'S24_1578', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Small'),
 (10107, 38, 83.03, 7, 3155.14, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 76, 'S24_2000', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Medium'),
 (10107, 20, 92.9, 8, 1858.0, '2/24/2003 0:00', 'Shipped', 1, 2, 2003, 'Motorcycles', 99, 'S32_1374', 'Land of Toys Inc.', '2125557818', '897 Long Airport Avenue', None, 'NYC', 'NY', '10022', 'USA', None, 'Yu', 'Kwai', 'Small')]

In [27]:
engine.execute("SELECT count(*) FROM sales_data where ordernumber='10107'").fetchall()

[(16,)]

In [28]:
engine.execute("DROP DATABASE IF EXISTS sales")
print("Excluindo o DB sales")

Excluindo o DB sales

# Usando o SGDB sqlite3

In [29]:
import pandas as pd
import sqlite3

In [30]:
df = pd.read_excel('sales_data_sample2.xlsx')
conn = sqlite3.connect('sales.db')

c = conn.cursor()
c.execute("CREATE TABLE IF NOT EXISTS salesdata ({})".format(' ,'.join(df.columns)))

In [31]:
for row in df.iterrows():
    sql = 'INSERT INTO salesdata ({}) VALUES ({})'.format(' ,'.join(df.columns), ','.join(['?']*len(df.columns)))
    c.execute(sql, tuple(row[1]))
conn.commit()

In [32]:
df.shape

(2823, 25)

In [33]:
c.execute("delete from salesdata where DEALSIZE='Small'")
conn.commit()

# salvar a saida de um select como dataframe

In [34]:
df1 = pd.read_sql_query("select * from salesdata",conn)
df1.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10134,41,94.74,2,3884.34,2003-01-07 00:00:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,Null,Paris,Null,75508,France,EMEA,Da Cunha,Daniel,Medium
1,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,Null,Pasadena,CA,90003,USA,None,Young,Julie,Medium
2,10159,49,100.00,14,5205.27,2003-10-10 00:00:00,Shipped,4,10,2003,...,7734 Strong St.,Null,San Francisco,CA,Null,USA,None,Brown,Julie,Medium
3,10168,36,96.66,1,3479.76,10/28/2003 0:00,Shipped,4,10,2003,...,9408 Furth Circle,Null,Burlingame,CA,94217,USA,None,Hirano,Juri,Medium
4,10188,48,100.00,1,5512.32,11/18/2003 0:00,Shipped,4,11,2003,...,"Drammen 121, PR 744 Sentrum",Null,Bergen,Null,N 5804,Norway,EMEA,Oeztan,Veysel,Medium

In [35]:
df1.shape

(1541, 25)

In [36]:
conn.close()

In [37]:
!jupyter nbconvert --to HTML pymysql_funcao_to-sql.ipynb

[NbConvertApp] Converting notebook pymysql_funcao_to-sql.ipynb to HTML
[NbConvertApp] Writing 641679 bytes to pymysql_funcao_to-sql.html